In [1]:
import pandas as pd

In [4]:
from db import DemoDB

In [5]:
database = DemoDB()

Indexing schema. This will take a second...finished!

In [7]:
database.tables

+--------+---------------+----------------------------------------------------------------------------------+
| Schema | Table         | Columns                                                                          |
+--------+---------------+----------------------------------------------------------------------------------+
| public | Album         | AlbumId, Title, ArtistId                                                         |
| public | Artist        | ArtistId, Name                                                                   |
| public | Customer      | CustomerId, FirstName, LastName, Company, Address, City, State, Country, PostalC |
|        |               | ode, Phone, Fax, Email, SupportRepId                                             |
| public | Employee      | EmployeeId, LastName, FirstName, Title, ReportsTo, BirthDate, HireDate, Address, |
|        |               |  City, State, Country, PostalCode, Phone, Fax, Email                             |
| public | Genre         | GenreId, Name                                                                    |
| public | Invoice       | InvoiceId, CustomerId, InvoiceDate, BillingAddress, BillingCity, BillingState, B |
|        |               | illingCountry, BillingPostalCode, Total                                          |
| public | InvoiceLine   | InvoiceLineId, InvoiceId, TrackId, UnitPrice, Quantity                           |
| public | MediaType     | MediaTypeId, Name                                                                |
| public | Playlist      | PlaylistId, Name                                                                 |
| public | PlaylistTrack | PlaylistId, TrackId                                                              |
| public | Track         | TrackId, Name, AlbumId, MediaTypeId, GenreId, Composer, Milliseconds, Bytes, Uni |
|        |               | tPrice                                                                           |
+--------+---------------+----------------------------------------------------------------------------------+

In [10]:
album = database.tables.Album.head()

In [11]:
album

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3
5        6                     Jagged Little Pill         4

In [33]:
artist = database.tables.Artist.all()

In [35]:
artist.head()

   ArtistId               Name
0         1              AC/DC
1         2             Accept
2         3          Aerosmith
3         4  Alanis Morissette
4         5    Alice In Chains

In [38]:
album_artists.tail()

   ArtistId               Name  AlbumId               Title
1         1              AC/DC        4   Let There Be Rock
2         2             Accept        2   Balls to the Wall
3         2             Accept        3   Restless and Wild
4         3          Aerosmith        5            Big Ones
5         4  Alanis Morissette        6  Jagged Little Pill

In [39]:
album.rename(columns={'ArtistId':'Artist_id'}, inplace=True)

In [27]:
album.head()

   AlbumId                                  Title  Artist_id
0        1  For Those About To Rock We Salute You          1
1        2                      Balls to the Wall          2
2        3                      Restless and Wild          2
3        4                      Let There Be Rock          1
4        5                               Big Ones          3

In [29]:
album_artists = pd.merge(artist, album, left_on='ArtistId', right_on='Artist_id')

In [30]:
album_artists.tail()

   ArtistId               Name  AlbumId               Title  Artist_id
1         1              AC/DC        4   Let There Be Rock          1
2         2             Accept        2   Balls to the Wall          2
3         2             Accept        3   Restless and Wild          2
4         3          Aerosmith        5            Big Ones          3
5         4  Alanis Morissette        6  Jagged Little Pill          4

In [31]:
album_artists = pd.merge(artist, album, left_on='ArtistId', right_on='Artist_id').drop('Artist_id', axis=1)

In [32]:
album_artists

   ArtistId               Name  AlbumId                                  Title
0         1              AC/DC        1  For Those About To Rock We Salute You
1         1              AC/DC        4                      Let There Be Rock
2         2             Accept        2                      Balls to the Wall
3         2             Accept        3                      Restless and Wild
4         3          Aerosmith        5                               Big Ones
5         4  Alanis Morissette        6                     Jagged Little Pill

In [47]:
alunos1 = pd.DataFrame({
    'nome': ['maria', 'joao'],
    'nota': [8, 9],
})

alunos2 = pd.DataFrame({
    'nome': ['sofia','maria', 'pedro'],
    'nota': [1,2,3],
})

In [50]:
alunos = pd.merge(alunos1, alunos2, on='nome')

In [51]:
alunos

    nome  nota_x  nota_y
0  maria       8       2

In [53]:
alunos = pd.merge(alunos1, alunos2, how='outer', on='nome')

In [54]:
alunos

    nome  nota_x  nota_y
0  maria     8.0     2.0
1   joao     9.0     NaN
2  sofia     NaN     1.0
3  pedro     NaN     3.0